# Taps
tap "1password/tap"
tap "gromgit/brewtils"

# Formulae
brew "bat"
brew "codex"
brew "direnv"
brew "eza"
brew "fd"
brew "fzf"
brew "git"
brew "huggingface-cli"
brew "hyperfine"
brew "mactop"
brew "mise"
brew "mole"
brew "ncdu"
brew "overmind"
brew "pre-commit"
brew "ripgrep"
brew "stow"
brew "taproom"
brew "tmux"
brew "tokei"
brew "tree"
brew "watch"
brew "zoxide"
brew "llmfit"

# Casks
cask "1password-cli"
cask "copilot-cli"
cask "ghostty"
cask "jetbrains-toolbox"
cask "spotify"
cask "unnaturalscrollwheels"
cask "visual-studio-code"
